#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Расставьте знаки операций "плюс", "минус", "умножение" и скобки
# между числами "1 2 3 4 5" так, что бы получилось число "25".
#
# Использовать нужно только указанные знаки операций, но не обязательно все перечесленные.
# Порядок чисел нужно сохранить.

# Пример для чисел "1 2 3" и "9"
result = (1 + 2) * 3
print(result)

# TODO написать формулу для 1 2 3 4 5 и вывести значение на консоль
def operation_numbers():
    """Уравнение с числами 1,2,3,4,5"""
    return (1 * (2 + 3)) + (4 * 5)

def demo():
    result = operation_numbers()
    print("Результат уравнения (1 * (2 + 3)) + (4 * 5) = ", result)

